{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 74, "b_regularizer": null, "W_regularizer": null, "output_dim": 10, "batch_input_shape": [null, 74]}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 1, "W_constraint": null, "name": "embedding_1", "activity_regularizer": null, "trainable": true, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "batch_input_shape": [null, 1], "W_regularizer": null, "dropout": 0.0, "input_dim": 444, "output_dim": 10}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 1, "W_constraint": null, "name": "embedding_2", "activity_regularizer": null, "trainable": true, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "batch_input_shape": [null, 1], "W_regularizer": null, "dropout": 0.0, "input_dim": 7, "output_dim": 10}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 1, "W_constraint": null, "name": "embedding_3", "activity_regularizer": null, "trainable": true, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "batch_input_shape": [null, 1], "W_regularizer": null, "dropout": 0.0, "input_dim": 24, "output_dim": 10}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 1, "W_constraint": null, "name": "embedding_4", "activity_regularizer": null, "trainable": true, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "batch_input_shape": [null, 1], "W_regularizer": null, "dropout": 0.0, "input_dim": 2, "output_dim": 10}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}}]}], "name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 800}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 91}}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0003\u0000\u0000\u0000C\u0000\u0000\u0000s*\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000d\u0001\u0000\u0083\u0001\u0000}\u0001\u0000|\u0001\u0000d\u0002\u0000\u0019\u001e}\u0002\u0000t\u0002\u0000j\u0003\u0000|\u0000\u0000|\u0002\u0000\u0083\u0002\u0000S(\u0003\u0000\u0000\u0000Ns\n\u0000\u0000\u0000cluster.h5t\u0007\u0000\u0000\u0000cluster(\u0004\u0000\u0000\u0000t\u0004\u0000\u0000\u0000h5pyt\u0004\u0000\u0000\u0000Filet\u0001\u0000\u0000\u0000Kt\u0003\u0000\u0000\u0000dot(\u0003\u0000\u0000\u0000t\u0006\u0000\u0000\u0000inputst\u0001\u0000\u0000\u0000ft\u000f\u0000\u0000\u0000cluster_centers(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s7\u0000\u0000\u0000/home/xuguanggen/competition/taxi/shanghai/src/utils.pyt\r\u0000\u0000\u0000caluate_point\u0090\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001\u000f\u0001\u000b\u0001", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [2], "output_shape_type": "raw"}}]}